src/cf/DataProcessors/ЗагрузкаМодуляМенеджера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаМодуляМенеджера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьОтсутствующиеАлгоритмы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовуюКонвертацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовуюКонфигурацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьРасхожденияВПравилах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеФайловНаКлиенте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМенеджераКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьМетаданные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаМодуляМенеджера/Forms/ФормаПомощникЗагрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийЭтап = "ВыборКонвертации";
	// Чтобы отличать не установленное значение от установленного.
	Объект.ИсточникЗагрузки = -1;

	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКонвертациюДляЗагрузки(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьКонвертациюДляЗагрузкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗагрузкаМодуляМенеджера.Форма.ФормаВыборКонвертации",
			, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИсточникЗагрузки(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьИсточникЗагрузкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗагрузкаМодуляМенеджера.Форма.ФормаПараметрыЗагрузки",
			, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьРасхождения(Команда)
	Если ПроверитьБлокировкуКонвертации() = Ложь Тогда
		Возврат;
	КонецЕсли;
	// Заблокируем предыдущие этапы.
	Этап1 = Этапы.НайтиСтроки(Новый Структура("Название", "ВыборКонвертации"));
	Этап1[0].Недоступен = Истина;
	Этап2 = Этапы.НайтиСтроки(Новый Структура("Название", "ВыборИсточникаЗагрузки"));
	Этап2[0].Недоступен = Истина;
	ОбновитьОтображениеТекущегоСостоянияНастройки();

	Если ПравилаЗагружены Тогда
		ТекущийЭтап = "ПросмотрРасхождений";
		ВыполнитьАнализРасхожденийКлиент();
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
		Возврат;
	КонецЕсли;
	ДлительнаяОперация = Истина;
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	Ошибки = "";
	ЕстьОшибки = Ложь; 
	ТекущаяКоманда = "ПосмотретьРасхождения";
	ПрогрессЗадания = НСтр("ru='Подготовка файлов для загрузки'");
	ПодготовитьФайлыДляЗагрузкиНачало();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаКонвертации(Команда)
	Если (ТекущийЭтап <> "Загрузка" И ТекущийЭтап <> "Ошибки") Или ДлительнаяОперация = Истина Тогда
		Возврат;
	КонецЕсли;
	Если ПроверитьБлокировкуКонвертации() = Ложь Тогда
		Возврат;
	КонецЕсли;
	Этап1 = Этапы.НайтиСтроки(Новый Структура("Название", "ПросмотрРасхождений"));
	Этап1[0].Недоступен = Истина;
	ОбновитьОтображениеТекущегоСостоянияНастройки();

	ДлительнаяОперация = Истина;  
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	Ошибки = "";
	ЕстьОшибки = Ложь;
	ТекущаяКоманда = "ЗагрузитьПравилаКонвертации";
	ПодготовитьФайлыДляЗагрузкиНачало();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкиЗагрузки(Команда)
	Если НЕ ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЗагрузкаМодуляМенеджера.Форма.ФормаОшибки",
			, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроцессЗагрузкиЗаново(Команда)
	ПриЗакрытииНаСервере();
	Объект.ПоказыватьРасхожденияВПравилах = Ложь;
	Объект.РасположениеФайловНаКлиенте = "";
	Объект.ИмяМенеджераКонвертации = "";
	Объект.Релиз = Неопределено;
	Объект.СоздатьНовуюКонвертацию = Ложь;  
	Объект.СоздатьНовуюКонфигурацию = Ложь;
	Объект.Конвертация = Неопределено;
	Элементы.ВыбратьКонвертациюДляЗагрузки.РасширеннаяПодсказка.Заголовок = НСтр("ru='Конвертация не выбрана'");
	Элементы.НастроитьИсточникЗагрузки.РасширеннаяПодсказка.Заголовок = НСтр("ru='Источник загрузки не настроен'");
	Элементы.ПосмотретьРасхождения.РасширеннаяПодсказка.Заголовок = НСтр("ru='Посмотреть расхождения правил с существующей конвертацией и выбрать правила для загрузки'");
	Элементы.ЗагрузитьПравилаКонвертации.РасширеннаяПодсказка.Заголовок = НСтр("ru='Запустить процесс загрузки правил конвертации'");
	Элементы.ПоказатьОшибкиЗагрузки.РасширеннаяПодсказка.Заголовок = НСтр("ru='Вывести список ошибок при загрузке данных'");
	ТекущийЭтап = "ВыборКонвертации";
	Объект.ИсточникЗагрузки = -1; 
	Ошибки = "";
	ВыбранныеРасхождения = Неопределено;
	ЕстьОшибки = Ложь;
	ЗагружаютсяМетаданные = Ложь;
	ИмяВременногоКаталогаФайлов = "";
	ИмяНовойКонвертации = "";
	ИмяНовойКонфигурации = "";
	КоличествоКаталоговВОбработке = 0;
	ПравилаЗагружены = Ложь;
	ПрогрессЗадания = "";
	СравниваютсяПравила = Ложь;
	ТекущаяКоманда = "";
	ТекущийЭтап = "ВыборКонвертации";
	ФайлыДляОбработкиСервер.Очистить();
	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
КонецПроцедуры


#КонецОбласти

#Область ИнициализацияФормыПриСоздании

&НаКлиенте
Функция ДобавитьЭтапНастройки(Название, Кнопка, ЭлементыФормы)
	
	СтрокаЭтап = Этапы.Добавить();
	СтрокаЭтап.Название        = Название;
	СтрокаЭтап.Кнопка          = Кнопка;
	СтрокаЭтап.Используется    = Истина;
	СтрокаЭтап.Недоступен      = Ложь;
	СтрокаЭтап.Основное        = Истина;
	
	ЗаполнитьЗначенияСвойств(СтрокаЭтап, ЭлементыФормы);
	
	Возврат СтрокаЭтап;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуЭтаповНастройки()
	
	Этапы.Очистить();

	// Выбор конвертации
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаВыборКонвертации.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельВыборКонвертации.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаВыборКонвертацииУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаВыборКонвертацииТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаВыборКонвертацииПустой.Имя); 
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, "");
    ДобавитьЭтапНастройки("ВыборКонвертации", "ВыбратьКонвертациюДляЗагрузки", ЭлементыФормы);

	// Настройка источника	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаВыборИсточникаЗагрузки.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельВыборИсточникаЗагрузки.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаВыборИсточникаЗагрузкиУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаВыборИсточникаЗагрузкиТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаВыборИсточникаЗагрузкиПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, "");
	ДобавитьЭтапНастройки("ВыборИсточникаЗагрузки", "НастроитьИсточникЗагрузки", ЭлементыФормы);
		
	// Просмотр расхождений
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаПросмотрРасхождений.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельПросмотрРасхождений.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаПросмотрРасхожденийУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаПросмотрРасхожденийТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаПросмотрРасхожденийПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, Элементы.СтраницаПросмотрРасхожденийДлительнаяОперация.Имя);
	
	ДобавитьЭтапНастройки("ПросмотрРасхождений", "ПосмотретьРасхождения", ЭлементыФормы);
		
	// Загрузка	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаЗагрузкаПравил.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельЗагрузкаПравил.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаЗагрузкаПравилУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаЗагрузкаПравилТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаЗагрузкаПравилПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, Элементы.СтраницаЗагрузкаПравилДлительнаяОперация.Имя);
	
	ДобавитьЭтапНастройки("Загрузка", "ЗагрузитьПравилаКонвертации", ЭлементыФормы); 
	
	// Ошибки
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаОшибкиЗагрузки.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельОшибкиЗагрузки.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаОшибкиЗагрузкиПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаОшибкиЗагрузкиТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаОшибкиЗагрузкиПустой.Имя);
	
	ДобавитьЭтапНастройки("Ошибки", "ПоказатьОшибкиЗагрузки", ЭлементыФормы); 
		
КонецПроцедуры


#КонецОбласти 
 #Область СлужебныеПроцедурыИФункции 
 &НаКлиенте
Процедура ОбновитьОтображениеТекущегоСостоянияНастройки() 
	Элементы.ГруппаРезультатЗагрузки.Видимость = Ложь;
	Элементы.ГруппаНачатьЗаново.Видимость = Ложь;
	// Видимость элементов настройки.
	Для Каждого ЭтапНастройки Из Этапы Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭтапНастройки.Группа, "Доступность", ЭтапНастройки.Используется И НЕ ЭтапНастройки.Недоступен);
		Если НЕ ЭтапНастройки.Используется Тогда
			Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
		ИначеЕсли ПустаяСтрока(ТекущийЭтап) Тогда
			Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ТекущийЭтап) Тогда
		Если Объект.СоздатьНовуюКонвертацию Тогда
			// Если загружена новая конвертация и новая конфигурация это надо отобразить.
			Элементы.ЗагрузитьПравилаКонвертации.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
			Элементы.ГруппаРезультатЗагрузки.Видимость = Истина;
		КонецЕсли;
	Иначе
		ТекущийЭтапНайден = Ложь;
		Для Каждого ЭтапНастройки Из Этапы Цикл
			Если НЕ ЭтапНастройки.Используется Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтапНастройки.Название = ТекущийЭтап Тогда
				Элементы[ЭтапНастройки.Группа].Доступность = Истина; 
				Если ДлительнаяОперация И ЗначениеЗаполнено(ЭтапНастройки.СтраницаДлительнаяОперация) Тогда
					Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаДлительнаяОперация]; 
				Иначе
					Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаТекущий];  
				КонецЕсли;
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииВажнаяШрифт");
				ТекущийЭтапНайден = Истина;
			ИначеЕсли Не ТекущийЭтапНайден Тогда
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			Иначе
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонвертациюДляЗагрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, РезультатЗакрытия, "Конвертация, Релиз, СоздатьНовуюКонвертацию, СоздатьНовуюКонфигурацию, ПоказыватьРасхожденияВПравилах, ОбновлятьМетаданные");
		ИмяНовойКонвертации = РезультатЗакрытия.ИмяНовойКонвертации;
		ИмяНовойКонфигурации = РезультатЗакрытия.ИмяНовойКонфигурации;  

		ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.ВыбратьКонвертациюДляЗагрузки.РасширеннаяПодсказка.Заголовок = РезультатЗакрытия.ОписаниеРезультата;
		ТекущийЭтап = "ВыборИсточникаЗагрузки"; 
		// Сбросим выбранные ранее настройки если они были сделаны.
		Объект.РасположениеФайловНаКлиенте = "";
		Объект.ИсточникЗагрузки = -1;
		ПравилаЗагружены = Ложь;
		ЭтапРасхождения = Этапы.НайтиСтроки(Новый Структура("Название", "ПросмотрРасхождений"));
		ЭтапРасхождения[0].Используется = Объект.ПоказыватьРасхожденияВПравилах;
		ОбновитьОтображениеТекущегоСостоянияНастройки();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура НастроитьИсточникЗагрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, РезультатЗакрытия, "ИсточникЗагрузки, РасположениеФайловНаКлиенте, ИмяМенеджераКонвертации");

		ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.НастроитьИсточникЗагрузки.РасширеннаяПодсказка.Заголовок = РезультатЗакрытия.ОписаниеРезультата; 
		ПравилаЗагружены = Ложь;
		Если Объект.ПоказыватьРасхожденияВПравилах Тогда
			ТекущийЭтап = "ПросмотрРасхождений";
		Иначе
			ТекущийЭтап = "Загрузка";
		КонецЕсли;
		ОбновитьОтображениеТекущегоСостоянияНастройки();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПосмотретьРасхожденияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если РезультатЗакрытия <> Неопределено Тогда
		Элементы.ПосмотретьРасхождения.РасширеннаяПодсказка.Заголовок = РезультатЗакрытия.ОписаниеРезультата;
		ВыбранныеРасхождения = РезультатЗакрытия.ТаблицаПравил;
		Если НЕ РезультатЗакрытия.ПравилаВыбраны Тогда
			ТекущийЭтап = "";
			ЭтапЗагрузка = Этапы.НайтиСтроки(Новый Структура("Название", "Загрузка"));
			ЭтапЗагрузка[0].Недоступен = Истина;
		Иначе
			ТекущийЭтап = "Загрузка"; 
		КонецЕсли;
		ОбновитьОтображениеТекущегоСостоянияНастройки();
		Элементы.ГруппаНачатьЗаново.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПодготовитьФайлыДляЗагрузкиНачало()
	ФайлыДляОбработкиСервер.Очистить();
	Если Объект.ИсточникЗагрузки < 2 Тогда
		// Загрузка в существующую конвертацию из буфера обмена или текстового файла.
		// 0 - буфер обмена, 1 - текстовый файл. 
		Если Объект.ИсточникЗагрузки = 0 Тогда
			КОбъект = Новый COMОбъект("htmlfile");
			ТекстМодуля = КОбъект.ParentWindow.ClipboardData.Getdata("Text");
			#Если НЕ ВебКлиент Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt"); 
			ТекстДок = Новый ТекстовыйДокумент;
			ТекстДок.ДобавитьСтроку(ТекстМодуля);
			ТекстДок.Записать(ИмяВременногоФайла);
			АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
			ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", ИмяВременногоФайла, АдресХранилища, Ложь));
			ЗапуститьПроцессПослеПодготовкиФайлов();
			#КонецЕсли
			Возврат;
		ИначеЕсли Объект.ИсточникЗагрузки = 1 Тогда
			ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПроверкиСуществованияФайла", ЭтотОбъект,
				Новый Структура("ТекстСообщенияОбОшибке", НСтр("ru='Не найден текстовый файл с модулем менеджера'")));
			НачатьПоискФайлов(ОповещениеРезультатПоиска, Объект.РасположениеФайловНаКлиенте,,Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ФайлыДляОбработки = Новый Массив;
	Если Объект.ИсточникЗагрузки = 3 Тогда
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПроверкиСуществованияФайла", ЭтотОбъект, 
			Новый Структура("ТекстСообщенияОбОшибке", НСтр("ru='В каталоге не найден файл Configuration.xml'")));

		НачатьПоискФайлов(ОповещениеРезультатПоиска,Объект.РасположениеФайловНаКлиенте,"Configuration.xml",Ложь);
	Иначе
		// Файл project уже указан искать его не надо.
		// Для поиска файлов используется каталог в котором находится project
		ФайлПроекта = Новый Файл(Объект.РасположениеФайловНаКлиенте);
		ИтерацияПодготовкиФайлов(ФайлПроекта.Путь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПроверкиСуществованияФайла(НайденныеФайлы, ДополнительныеПараметры) Экспорт 
	Если НайденныеФайлы.Количество() = 0 Тогда
		ЕстьОшибки = Истина;
		Ошибки = Ошибки + ДополнительныеПараметры.ТекстСообщенияОбОшибке + Символы.ПС;
		ЗапуститьПроцессПослеПодготовкиФайлов();
		Возврат;
	КонецЕсли;
	Если Объект.ИсточникЗагрузки = 1 Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(Объект.РасположениеФайловНаКлиенте);
		#Если НЕ ВебКлиент Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", ИмяВременногоФайла, АдресХранилища, Ложь));
		ЗапуститьПроцессПослеПодготовкиФайлов();
		#КонецЕсли
		Возврат;
	КонецЕсли;
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НайденныеФайлы[0].ПолноеИмя), УникальныйИдентификатор);
	ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", НайденныеФайлы[0].ПолноеИмя, АдресХранилища));
	ИтерацияПодготовкиФайлов(Объект.РасположениеФайловНаКлиенте);
КонецПроцедуры

&НаКлиенте
Функция ИтерацияПодготовкиФайлов(КаталогЗагрузки)
	КаталогиДляОбработки = Новый Массив;
	КаталогиДляОбработки.Добавить("Catalogs");
	КаталогиДляОбработки.Добавить("Documents");
	КаталогиДляОбработки.Добавить("Enums");
	КаталогиДляОбработки.Добавить("Tasks");
	КаталогиДляОбработки.Добавить("BusinessProcesses");
	КаталогиДляОбработки.Добавить("ChartsOfAccounts");
	КаталогиДляОбработки.Добавить("ChartsOfCalculationTypes");
	КаталогиДляОбработки.Добавить("ChartsOfCharacteristicTypes");
	КаталогиДляОбработки.Добавить("AccountingRegisters");
	КаталогиДляОбработки.Добавить("AccumulationRegisters");
	КаталогиДляОбработки.Добавить("CalculationRegisters");
	КаталогиДляОбработки.Добавить("InformationRegisters");
	КаталогиДляОбработки.Добавить("ExchangePlans");
	КаталогиДляОбработки.Добавить("EventSubscriptions");
	КаталогиДляОбработки.Добавить("Constants");
	КаталогиДляОбработки.Добавить("DefinedTypes");
	КаталогиДляОбработки.Добавить("CommonModules");
	Если Объект.ИсточникЗагрузки = 2 Тогда
		КаталогиДляОбработки.Добавить("Configuration");
	КонецЕсли;

	РазделительПути = СокрЛП(ПолучитьРазделительПути());
	КоличествоКаталоговВОбработке = КаталогиДляОбработки.Количество(); 
	Если Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
		КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
		Если Объект.ИсточникЗагрузки = 3 Тогда
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + "Constants","*.xml",Ложь);
		Иначе
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + "Constants","*.mdo",Истина);
		КонецЕсли; 
	КонецЕсли;

	Для Каждого ИмяКаталога Из КаталогиДляОбработки Цикл
		Если Объект.ИсточникЗагрузки = 3 Тогда
			КаталогПоиска = КаталогЗагрузки + РазделительПути + ИмяКаталога;
		Иначе
			КаталогПоиска = КаталогЗагрузки + РазделительПути + "src" + РазделительПути + ИмяКаталога;
		КонецЕсли;
		Если ИмяКаталога = "CommonModules" Тогда
			ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.bsl",Истина);
		Иначе
			Если Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
				ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
				КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
				Если Объект.ИсточникЗагрузки = 3 Тогда
					НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.xml", Ложь);
					Если ИмяКаталога = "ExchangePlans" Тогда
						// Файлы с составом плана обмена.  
						КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
						ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
						НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"Content.xml",Истина);
					Иначе
						// Файлы с предопределенными элементами.
						КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
						ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
						НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"Predefined.xml",Истина);
					КонецЕсли;
				Иначе
					НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.mdo", Истина);
				КонецЕсли;
			КонецЕсли; 
			ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
			НачатьПоискФайлов(ОповещениеРезультатПоиска,КаталогПоиска,"ManagerModule.bsl", Истина);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗавершениеПоискаФайловВКаталоге(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке - 1;
	Если НайденныеФайлы.Количество() > 0 Тогда
		ОбработатьМассивФайлов(НайденныеФайлы);
	КонецЕсли;
	Если КоличествоКаталоговВОбработке > 0 Тогда
		Возврат;
	КонецЕсли;
	ЗапуститьПроцессПослеПодготовкиФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьМассивФайлов(ВложенныеФайлы)
	Если ВложенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ВложенныйФайл Из ВложенныеФайлы Цикл
		Если ВложенныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВложенныйФайл.ПолноеИмя), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", ВложенныйФайл.ПолноеИмя, АдресХранилища, Ложь));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроцессПослеПодготовкиФайлов()
	Если ЕстьОшибки Тогда
		ДлительнаяОперация = Ложь; 
		ТекущийЭтап = "Ошибки";
		ОбновитьОтображениеТекущегоСостоянияНастройки();
		Элементы.ГруппаНачатьЗаново.Видимость = Истина;
		Возврат;
	КонецЕсли;
	Если ТекущаяКоманда = "ЗагрузитьПравилаКонвертации" Тогда
		Если Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
			// Загрузка метаданных.
			ЗагружаютсяМетаданные = Истина;
			ЗапуститьДлительнуюОперацию_ЗагрузкаМетаданных();
		Иначе
			Если Объект.ПоказыватьРасхожденияВПравилах Тогда
				ИтерацияЗагрузки = 3;
			Иначе
				ИтерацияЗагрузки = 1;
			КонецЕсли;
			ЗапуститьДлительнуюОперацию_ЗагрузкаПравил(ИтерацияЗагрузки);
		КонецЕсли;
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
	ИначеЕсли ТекущаяКоманда = "ПосмотретьРасхождения" Тогда
		ЗапуститьДлительнуюОперацию_ЗагрузкаПравил(2); 
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
	КонецЕсли;
	ТекущаяКоманда = "";
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАнализРасхожденийКлиент()
	ДлительнаяОперация = Истина;
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	Ошибки = "";
	ЕстьОшибки = Ложь;
	СравниваютсяПравила = Истина;
	ЗапуститьДлительнуюОперацию_СравнениеПравил();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительнуюОперацию_ЗагрузкаМетаданных()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ПрогрессЗадания = "";
		
	// Преобразование помещенных файлов
	ПомещенныеФайлыДляПередачи = ПоместитьФайлыДляПередачи();
	
	СтруктураПараметров = Новый Структура("ПомещенныеФайлы",ПомещенныеФайлыДляПередачи);
	Если Объект.СоздатьНовуюКонфигурацию Тогда
		СтруктураПараметров.Вставить("Конфигурация", Справочники.Релизы.ПустаяСсылка());
		СтруктураПараметров.Вставить("ИмяНовойКонфигурации", ИмяНовойКонфигурации);
		СтруктураПараметров.Вставить("СпособЗагрузки", 0);
	Иначе
		СтруктураПараметров.Вставить("Конфигурация", Объект.Релиз);
		СтруктураПараметров.Вставить("СпособЗагрузки", 1);
	КонецЕсли;
	// В интерфейсе обработки загрузки загрузка из файлов xml = 0, из файлов edt = 1
	СтруктураПараметров.Вставить("ИсточникДанных", ?(Объект.ИсточникЗагрузки = 3, 0, 1)); 
	// По умолчанию - только для документов без проведения
	СтруктураПараметров.Вставить("ВариантЗагрузкиДвижений", 1);
	СтруктураПараметров.Вставить("ТолькоОбновитьПланыОбмена", Ложь);
	СтруктураПараметров.Вставить("ТолькоДобавлятьНовые", Ложь);
	СтруктураПараметров.Вставить("ЕстьРасширения", Ложь);
	СтруктураПараметров.Вставить("ИмяКаталогаЗагрузки", Объект.РасположениеФайловНаКлиенте);
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка структуры метаданных из каталога'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаСтруктурыКонфигурацииИзФайловXML.ВыполнитьЗагрузкуМетаданных",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		Ошибки = Ошибки + НСтр("ru = 'При загрузке структуры конфигурации произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПрогрессЗадания = "";
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузки", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
	ЭлементПрогрессЗадания = Неопределено;
	Если ТекущийЭтап = "ПросмотрРасхождений" Тогда
		ЭлементПрогрессЗадания = Элементы.ДекорацияСтатусДлительнойОперацииРасхождения;
	ИначеЕсли ТекущийЭтап = "Загрузка" Тогда
		ЭлементПрогрессЗадания = Элементы.ДекорацияСтатусДлительнойОперацииЗагрузка;
	КонецЕсли;
	Если ЭлементПрогрессЗадания <> Неопределено Тогда
		ЭлементПрогрессЗадания.Заголовок = ПрогрессЗадания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ДанныеОПрогрессе = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	Если ТипЗнч(ДанныеОПрогрессе) = Тип("Структура") Тогда
		ПрогрессЗадания = ДанныеОПрогрессе.Текст;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузки() 
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата); 
	РезультатЗагрузкиУспешно = Ложь;
	РезультатЗагрузкиОшибки = "";
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		РезультатЗагрузкиУспешно = РезультатЗагрузки.Успешно;
		РезультатЗагрузкиОшибки = РезультатЗагрузки.Ошибки;
	КонецЕсли;
	Если ЗагружаютсяМетаданные Тогда
		Если РезультатЗагрузкиУспешно Тогда
			ИтерацияЗагрузки = 1;
			Если Объект.СоздатьНовуюКонфигурацию Тогда
				Объект.Релиз = РезультатЗагрузки.Релиз;
			ИначеЕсли Объект.ПоказыватьРасхожденияВПравилах Тогда
				ИтерацияЗагрузки = 3;
			КонецЕсли;
			ЗапуститьДлительнуюОперацию_ЗагрузкаПравил(ИтерацияЗагрузки);
			ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина);
		Иначе
			ДлительнаяОперация = Ложь;
			Ошибки = Ошибки + НСтр("ru = 'При загрузке структуры конфигурации произошли ошибки'") + Символы.ПС + РезультатЗагрузкиОшибки;
			ЕстьОшибки = Истина;
		КонецЕсли;
	Иначе
		ДлительнаяОперация = Ложь;
		Если НЕ РезультатЗагрузкиУспешно Тогда
			Если СравниваютсяПравила Тогда
				Ошибки = Ошибки + НСтр("ru = 'При сравнении правил конвертации произошли ошибки'") + Символы.ПС + РезультатЗагрузкиОшибки;
			Иначе
				Ошибки = Ошибки + НСтр("ru = 'При загрузке правил конвертации произошли ошибки'") + Символы.ПС + РезультатЗагрузкиОшибки;
			КонецЕсли;
			ЕстьОшибки = Истина;  
		ИначеЕсли ТекущийЭтап = "Загрузка" Тогда
			ТекущийЭтап = "";
			Если Объект.СоздатьНовуюКонвертацию И РезультатЗагрузки.Свойство("Конвертация") Тогда
				Объект.Конвертация = РезультатЗагрузки.Конвертация;
			КонецЕсли;
		ИначеЕсли ТекущийЭтап = "ПросмотрРасхождений" Тогда
			Если СравниваютсяПравила Тогда
				СравниваютсяПравила = Ложь;
				ПрогрессЗадания = НСтр("ru='Подготовка формы просмотра расхождений'");
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПосмотретьРасхожденияЗавершение", ЭтотОбъект);
				ПараметрыФормыРасхождений = Новый Структура("ТаблицаРасхождений, ВыбранныеРасхождения", РезультатЗагрузки.ТаблицаРасхождений, Неопределено);
				Если ТипЗнч(ВыбранныеРасхождения) = Тип("ХранилищеЗначения") Тогда
					ПараметрыФормыРасхождений.ВыбранныеРасхождения = ВыбранныеРасхождения;
				КонецЕсли;
				ОткрытьФорму("Обработка.ЗагрузкаМодуляМенеджера.Форма.ФормаПросмотрРасхождений",
						ПараметрыФормыРасхождений, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Иначе
				ПравилаЗагружены = Истина;
				ВыполнитьАнализРасхожденийКлиент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	Этап1 = Этапы.НайтиСтроки(Новый Структура("Название", "Ошибки"));
	Этап1[0].Недоступен = НЕ ЕстьОшибки;
	Если ЕстьОшибки Тогда
		Если ТекущийЭтап = "ПросмотрРасхождений" Тогда
			// Надо сделать недоступным этап загрузки.
			ЭтапЗагрузка = Этапы.НайтиСтроки(Новый Структура("Название", "Загрузка"));
			ЭтапЗагрузка[0].Недоступен = Истина;
		КонецЕсли;
		ТекущийЭтап = "Ошибки"; 
	КонецЕсли;
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	Если ТекущийЭтап = "" Или ТекущийЭтап = "Ошибки" Тогда
		СнятьБлокировкуКонвертации();
		Элементы.ГруппаНачатьЗаново.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительнуюОперацию_ЗагрузкаПравил(ИтерацияЗагрузки) 
	ЗагружаютсяМетаданные = Ложь;
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ПрогрессЗадания = "";
	Если ИтерацияЗагрузки = 3 Тогда
		ПроцедураФоновогоЗадания = "Обработки.ЗагрузкаМодуляМенеджера.ПеренестиИзмененияВПравилах"; 
		НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка выбранных изменений'");
		СтруктураПараметров = Новый Структура("ВыбранныеРасхождения, Конвертация", ВыбранныеРасхождения, Объект.Конвертация);
	Иначе
		ПрогрессЗадания = НСтр("ru='Передача файлов на сервер'");
		// Преобразование помещенных файлов
		ПомещенныеФайлыДляПередачи = ПоместитьФайлыДляПередачи();
		
		СтруктураПараметров = Новый Структура("ИсточникЗагрузки, ПомещенныеФайлы", Объект.ИсточникЗагрузки, ПомещенныеФайлыДляПередачи); 
		СтруктураПараметров.Вставить("Конвертация", Объект.Конвертация);
		СтруктураПараметров.Вставить("СоздатьНовуюКонвертацию", Объект.СоздатьНовуюКонвертацию); 
		СтруктураПараметров.Вставить("ИмяНовойКонвертации", ИмяНовойКонвертации);
		СтруктураПараметров.Вставить("Конфигурация", Объект.Релиз); 
		СтруктураПараметров.Вставить("ИмяМенеджераКонвертации", СокрЛП(Объект.ИмяМенеджераКонвертации));
		СтруктураПараметров.Вставить("ТолькоОбработчики", Ложь);
		СтруктураПараметров.Вставить("ИтерацияЗагрузки", ИтерацияЗагрузки); 
		ПроцедураФоновогоЗадания = "Обработки.ЗагрузкаМодуляМенеджера.ВыполнитьЗагрузкуМодуляМенеджера"; 
		НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка конвертации'");
	КонецЕсли;
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне(ПроцедураФоновогоЗадания,
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ТекОшибка = НСтр("ru = 'При запуске задания %1 произошла ошибка'");
		ТекОшибка = СтрЗаменить(ТекОшибка, "%1", НаименованиеФоновогоЗадания);
		Ошибки = Ошибки + ТекОшибка + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительнуюОперацию_СравнениеПравил()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ПрогрессЗадания = "";
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Конвертация", Объект.Конвертация);
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Сравнение правил'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаМодуляМенеджера.СравнитьПравилаКонвертации",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		Ошибки = Ошибки + НСтр("ru = 'При сравнении правил произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПоместитьФайлыДляПередачи()
	ПомещенныеФайлыДляПередачи = Новый Массив;
	ИмяВременногоКаталогаФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(КаталогВременныхФайлов()) + "_conf_" + Строка(Новый  УникальныйИдентификатор));
	СоздатьКаталог(ИмяВременногоКаталогаФайлов);

	Для Каждого ПомФайл Из ФайлыДляОбработкиСервер Цикл
		ИмяФайлаСведений = ИмяВременногоКаталогаФайлов + Строка(Новый  УникальныйИдентификатор);
		Если СтрНайти(ПомФайл.Значение.ПолноеИмя, ".xml") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".xml";
		ИначеЕсли СтрНайти(ПомФайл.Значение.ПолноеИмя, ".bsl") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".bsl";
		ИначеЕсли СтрНайти(ПомФайл.Значение.ПолноеИмя, ".mdo") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".mdo";
		КонецЕсли;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомФайл.Значение.Хранение);
		ДвоичныеДанные.Записать(ИмяФайлаСведений);
	
		ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение");
		ЗаполнитьЗначенияСвойств(ПараметрыФайла, ПомФайл.Значение);
		ПараметрыФайла.Вставить("ЭтоРасширение", Ложь);
		ПараметрыФайла.Хранение = ИмяФайлаСведений;
		ПомещенныеФайлыДляПередачи.Добавить(ПараметрыФайла);
	КонецЦикла; 
	Возврат ПомещенныеФайлыДляПередачи;
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере() 
	Если УстановленаБлокировкаКонвертации Тогда
		РазблокироватьДанныеДляРедактирования(Объект.Конвертация, ЭтаФорма.УникальныйИдентификатор);
		УстановленаБлокировкаКонвертации = Ложь;
	КонецЕсли;
	Если Объект.ПоказыватьРасхожденияВПравилах Тогда
		// Фоновое задание для удаления временных копий
		ИдентификаторЗадания = Неопределено;
		АдресХранилищаРезультата = ""; 
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Конвертация", Объект.Конвертация);
		ПрогрессЗадания = "";
		Попытка
			ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне();
			ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление временных копий'");
			ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
			ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаМодуляМенеджера.УдалитьВременныеКопии",
				СтруктураПараметров, ПараметрыФоновогоЗадания);
		Исключение
			Ошибки = Ошибки + НСтр("ru = 'При удалении временных копий произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
			ЕстьОшибки = Истина;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьБлокировкуКонвертации()
	Если НЕ УстановленаБлокировкаКонвертации Тогда
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Объект.Конвертация,,ЭтаФорма.УникальныйИдентификатор);
			УстановленаБлокировкаКонвертации = Истина;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Конвертация заблокирована для изменений. Невозможно выполнить загрузку.'"));
			Возврат Ложь;
		КонецПопытки; 
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция СнятьБлокировкуКонвертации()
	Если УстановленаБлокировкаКонвертации Тогда
		РазблокироватьДанныеДляРедактирования(Объект.Конвертация, ЭтаФорма.УникальныйИдентификатор);
		УстановленаБлокировкаКонвертации = Ложь;
	КонецЕсли;
КонецФункции
#КонецОбласти
